CanBeLocked Method
 Identifies if the element can be locked.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public bool CanBeLocked()
  Visual Basic
Public Function CanBeLocked As Boolean
  Visual C++
public:
bool CanBeLocked()
 Return Value
 True if the element can be locked, false otherwise.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →